<a href="https://colab.research.google.com/github/HassanA99/Image-Classification-Task/blob/main/Untitled32.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
print("hassan")

hassan

# SQL Operations with TMDB Database

In this section, I will connect to the TMDB (The Movie Database) database stored in `TMDB.db` and perform various SQL operations using SQLite.

In [9]:
!pip install sqlalchemy
!pip install ipython-sql

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (3.0.3)
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.10.2)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.31)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (71.0.4)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 41.4 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.1

## Step 2: Connecting to the Database

Next, I'll connect to the `TMDB.db` database

In [10]:
%load_ext sql

In [11]:
%sql sqlite:///TMDB.db

In [13]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///TMDB.db
Done.

[('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

# Perform Basic SQL Query
I'll retrieve the first few rows from the movies table to get a sense of the data.

In [31]:
%%sql
SELECT * FROM genres LIMIT 5;

 * sqlite:///TMDB.db
Done.

[(12, 'Adventure'),
 (14, 'Fantasy'),
 (16, 'Animation'),
 (18, 'Drama'),
 (27, 'Horror')]

In [21]:
%%sql
CREATE VIEW Not_Released AS SELECT * FROM movies WHERE release_status <> 'Released';

 * sqlite:///TMDB.db
Done.

[]

In [22]:
%%sql
Select title, release_date, release_status From Not_Released;

 * sqlite:///TMDB.db
Done.

[('Little Big Top', '2006-01-01 00:00:00.000000', 'Rumored'),
 ('The Helix... Loaded', '2005-01-01 00:00:00.000000', 'Rumored'),
 ('Higher Ground', '2011-08-26 00:00:00.000000', 'Post Production'),
 ('Crying with Laughter', '2009-06-01 00:00:00.000000', 'Rumored'),
 ('The Harvest (La Cosecha)', '2011-07-29 00:00:00.000000', 'Rumored'),
 ('The Naked Ape', '2006-09-16 00:00:00.000000', 'Rumored'),
 ('Brotherly Love', '2015-04-24 00:00:00.000000', 'Post Production'),
 ("Dancin' It's On", '2015-10-16 00:00:00.000000', 'Post Production')]

In [23]:
%%sql

SELECT COUNT(*)
FROM movies
WHERE title <> original_title;

 * sqlite:///TMDB.db
Done.

[(261,)]

In [24]:
%%sql
SELECT title
FROM movies
WHERE release_date > '2000-01-01'
  AND budget > 100000000
ORDER BY popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Interstellar',)]

In [25]:
%%sql
SELECT COUNT(*)
FROM movies
WHERE original_language != 'en';

 * sqlite:///TMDB.db
Done.

[(298,)]

In [26]:
%%sql
SELECT COUNT(*)
FROM movies m
JOIN ProductionCompanyMap pcm ON m.movie_id = pcm.movie_id
JOIN ProductionCompanies pc ON pcm.production_company_id = pc.production_company_id
WHERE pc.production_company_name = 'Pixar Animation Studios';

 * sqlite:///TMDB.db
Done.

[(16,)]

In [34]:
%%sql
SELECT COUNT(DISTINCT m.movie_id) AS num_movies
FROM Movies m
JOIN GenreMap gm1 ON m.movie_id = gm1.movie_id
JOIN Genres g1 ON gm1.genre_id = g1.genre_id
JOIN GenreMap gm2 ON m.movie_id = gm2.movie_id
JOIN Genres g2 ON gm2.genre_id = g2.genre_id
WHERE g1.genre_name = 'Romance'
AND g2.genre_name = 'Comedy';

 * sqlite:///TMDB.db
Done.

[(484,)]

In [36]:
%%sql
WITH ActionMovies AS (
  SELECT m.movie_id, m.title, m.popularity
  FROM Movies m
  JOIN GenreMap gm ON m.movie_id = gm.movie_id
  JOIN Genres g ON gm.genre_id = g.genre_id
  WHERE g.genre_name = 'Action'
)
SELECT a.title, a.popularity
FROM ActionMovies a
JOIN LanguageMap lm ON a.movie_id = lm.movie_id
JOIN Languages l ON lm.iso_639_1 = l.iso_639_1
WHERE l.language_name = 'Deutsch'
ORDER BY a.popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Captain America: Civil War', 198.372395)]

In [39]:
%%sql
SELECT COUNT(DISTINCT m.movie_id) AS Ethan_Hunt_Movies
FROM Movies m
JOIN Casts c ON m.movie_id = c.movie_id
JOIN Actors a ON c.actor_id = a.actor_id
WHERE a.actor_name = 'Tom Cruise'
  AND c.characters  = 'Ethan Hunt';

 * sqlite:///TMDB.db
Done.

[(5,)]

In [44]:
%%sql
select name, award, year
from oscars
where name = 'Cate Blanchett';

 * sqlite:///TMDB.db
Done.

[('Cate Blanchett', 'Actress in a Leading Role', '1998'),
 ('Cate Blanchett', 'Actress in a Supporting Role', '2004'),
 ('Cate Blanchett', 'Actress in a Supporting Role', '2006'),
 ('Cate Blanchett', 'Actress in a Leading Role', '2007'),
 ('Cate Blanchett', 'Actress in a Supporting Role', '2007'),
 ('Cate Blanchett', 'Actress in a Leading Role', '2013'),
 ('Cate Blanchett', 'Actress in a Leading Role', '2015')]

In [68]:
%%sql
SELECT COUNT(DISTINCT m.movie_id) AS Movies_with_SA_Languages
FROM Movies m
JOIN LanguageMap lm ON m.movie_id = lm.movie_id
JOIN Languages l ON lm.iso_639_1 = l.iso_639_1
WHERE l.language_name IN ('Afrikaans', 'isiZulu');

 * sqlite:///TMDB.db
Done.

[('Tsotsi', 8)]

In [66]:
%%sql
SELECT m.title, GROUP_CONCAT(l.language_name, ', ') AS Languages
FROM Movies m
JOIN LanguageMap lm ON m.movie_id = lm.movie_id
JOIN Languages l ON lm.iso_639_1 = l.iso_639_1
WHERE l.language_name IN ('isiZulu', 'Afrikaans')
GROUP BY m.movie_id;

 * sqlite:///TMDB.db
Done.

[('Tsotsi', 'Afrikaans, isiZulu'),
 ('Catch a Fire', 'Afrikaans, isiZulu'),
 ('Blood Diamond', 'Afrikaans'),
 ('District 9', 'Afrikaans, isiZulu'),
 ("Gangster's Paradise: Jerusalema", 'Afrikaans'),
 ('Faith Like Potatoes', 'isiZulu'),
 ('Safe House', 'Afrikaans'),
 ('Mandela: Long Walk to Freedom', 'Afrikaans')]

In [64]:
%%sql
SELECT language_name, count(*) as total
FROM Languages
WHERE language_name = 'fulfulde';

 * sqlite:///TMDB.db
Done.

[(None, 0)]

In [65]:
%%sql
SELECT l.language_name, COUNT(*) AS occurrence_count
FROM Languages l
JOIN LanguageMap lm ON l.iso_639_1 = lm.iso_639_1
GROUP BY l.language_name;

 * sqlite:///TMDB.db
Done.

[(None, 54),
 ('-slenska', 5),
 ('???', 204),
 ('??? / ???', 48),
 ('???/???', 31),
 ('????', 17),
 ('?????', 19),
 ('??????', 54),
 ('???????', 108),
 ('????????', 53),
 ('????????? ????', 3),
 ('???????????', 9),
 ('?esk²', 38),
 ('Afrikaans', 7),
 ('Bahasa indonesia', 2),
 ('Bamanankan', 1),
 ('Bosanski', 2),
 ('Catala', 1),
 ('Cymraeg', 2),
 ('Dansk', 14),
 ('Deutsch', 262),
 ('Eesti', 2),
 ('English', 4485),
 ('Espa±ol', 351),
 ('Esperanto', 2),
 ('Frantais', 437),
 ('Gaeilge', 6),
 ('Galego', 1),
 ('Hrvatski', 4),
 ('Italiano', 188),
 ('Kiswahili', 8),
 ('Latin', 52),
 ('Magyar', 42),
 ('Nederlands', 10),
 ('No Language', 2),
 ('Norsk', 13),
 ('P??????', 185),
 ('Polski', 53),
 ('PortuguOs', 68),
 ('RomGn?', 13),
 ('Sloven?ina', 2),
 ('SlovenÜ?ina', 1),
 ('Somali', 3),
 ('Srpski', 6),
 ('Ti?ng Vi?t', 17),
 ('Tnrkte', 18),
 ('Wolof', 1),
 ('isiZulu', 4),
 ('shqip', 4),
 ('suomi', 3),
 ('svenska', 22)]

In [72]:
%%sql
SELECT title, popularity
FROM Movies
WHERE title IN ("District 9", "Gangster's", "Paradise: Jerusalema", "Tsotsi", "Blood Diamond")
ORDER BY popularity DESC;

 * sqlite:///TMDB.db
Done.

[('District 9', 63.13678), ('Blood Diamond', 52.792678), ('Tsotsi', 2.504169)]